//Что выведет этот скрипт?
//let name = "Ilya";
//alert( `hello ${1}` ); // 1
//alert( `hello ${"name"}` ); // name
//alert( `hello ${name}` ); // Ilya
//-------------------------------------------------
//Чему будут равны переменные a, b, c и d в примере ниже?
//let a = 1, b = 1;
//let c = ++a; // 2
//let d = b++; // 1
//-------------------------------------------------
//Чему будут равны переменные a и x в примере ниже?
//let a = 2;
//let x = 1 + (a *= 2); //a=4 x=5
//-------------------------------------------------
//alert(5 > 4);//true
//alert("ананас" > "яблоко");//false
//alert("2" > "12");//true
//alert(undefined == null);//true
//alert(undefined === null);//false
//alert(null == "\n0\n");//false
//alert(null === +"\n0\n");//false
//-------------------------------------------------
//alert("Пример сообщения модального окна alert");
//let age = prompt("Сколько тебе лет?",'');
//alert(`Тебе ${age} лет!`);
//-------------------------------------------------
//let isBoss = confirm("Ты здесь главный?");
//alert(isBoss);
//-------------------------------------------------
//let name = prompt('Как к вам обращаться?','');
//alert(`Приветствуем тебя, о великий ${name}`);
//-------------------------------------------------
//let question = prompt("Какое официальное название JavaScript?", "");
//if (question == "ECMAScript") {
//  alert("Умничка! Возьми конфетку с полки...")
//} else {
//  alert("Не знаете? Стыдно, товарищи, не знать такие элементарные вещи!... ECMAScript")
//};
//-------------------------------------------------
//let number = prompt("Введите число, а мы сравним его с нулём","");
//if (number < 0) {
//  alert("-1 (ваше число меньше нуля)")
//} else {
//  if (number > 0) {
//    alert("1 (ваше число больше нуля)")
//  } else {
//    alert("0 (ваше число ноль... удивительно)")
//  }
//};
//-------------------------------------------------
//let result = (a + b < 4) ? "Мало" : "Много";
//-------------------------------------------------
//let message = (login == "Сотрудник") ? "Привет" : 
//  (login == "Директор") ? "Здравствуйте" : 
//  "Нет логина" : 
//  "";
//-------------------------------------------------
//Напишите условие if для проверки, что переменная age находится в диапазоне между 14 и 90 включительно. «Включительно» означает, что значение переменной age может быть равно 14 или 90.
//let age = prompt("Input your age", "");
//if (age >= 14 && age <= 90) {
//  alert("Let to see you!")
//} else {
//  alert("We are sorry")
//};
//-------------------------------------------------
//Возраст вне диапазона от 14 до 90. 2 варианта реализации:
//if (!(age >= 14 && age <= 90))
//if (age < 14 || age > 90)
//-------------------------------------------------